MSG_SET_NOT_FOUND = \
    "В Telegram нет пака с именем '{tg_set_name}' 😢\n" \
    "Пришли мне другое имя и попробуем еще разок!\n\n" \
    "Имя стикер пака можно получить пошарив пак в любой чат, " \
    "например, себе в \"Saved messages.\"\n" \
    "Получится ссылка вида: https://t.me/addstickers/RickAndMorty, " \
    "имя пака в этом случае - **RickAndMorty**\n" \
    "Еще можно поискать здесь: https://tlgrm.ru/stickers, " \
    "В этом случае имя пака будет в конце адресной строки браузера, например, " \
    "для https://tlgrm.ru/stickers/GravityFallsUn1 имя пака " \
    "- **GravityFallsUn1**, а не \"Gravity Falls\""

MSG_SET_IN_PROGRESS = \
    "Один момент, я уже готовлю архив со стикерами из пака:\n{tg_set_name}: " \
    "https://t.me/addstickers/{tg_set_name}"

MSG_WELCOME = \
    "Привет 👋\nЯ помогу скачать твой любимый набор стикеров " \
    "из Telegram и расскажу, как загрузить его в TamTam.\n" \
    "Просто пришли мне имя стикер-пака\n"

MSG_ERROR = \
    "Извини, произошло что-то непредвиденное в процессе 😢\nПопробуй другой пак.\n" \
    "Я еще молод и стараюсь стать лучше 😉"

MSG_SUCCESS = \
    "Готово 🥳\nЧтобы загрузить пак в ТамТам надо сделать еще пару кликов:\n" \
    "Пишем боту: https://tt.me/stickers\n" \
    "Делаем все по инструкции от бота. Примерно так:\n" \
    "- создать новый пак\n" \
    "- отправить полученный тут zip со стикерами, бот ответит, что все ок\n" \
    "- если архивов несколько - загрузить следующий\n" \
    "- ...\n" \
    "- PROFIT!\n"

MSG_MANY_STICKERS = \
    "Тебе немного не повезло, в исходном Telegram паке больше 50-ти стикеров.\n"\
    "ТамТам разрешает загрузить до 50 штук в одном архиве.\n" \
     "Я пришлю несколько архивов, их нужно будет отправить боту " \
     "(https://tt.me/stickers) по очереди, дожидаясь обработки предыдушего."
